# Desafio do restaurante Fome Zero
## Perguntas de negocios
### Geral
- Quantos restaurantes únicos estão registrados
- Quantos países únicos estão registrados
- Quantas cidades únicas estão registradas
- Qual o total de avaliações feitas
- Qual o total de tipos de culinária registrados
### Países
- Qual o nome do país que mais possui cidade registradas
- Qual o nome do país que mais tem restaurantes registrados
- Qual o nome do país que mais possui restaurantes com nivel de preço gourmet registrados
- Qual o nome do país que mais possui tipos de culinárias diferentes
- Qual o nome do país que mais possui avaliacoes feitas
- Qual o nome do país que mais tem restaurantes que fazem entregas
- Qual o nome do país que tem mais restaurantes aceitando reservas
- Qual o nome do país que possui, na média, a maior nota registrada
- Qual o nome do pais que possui a menor nota média registrada
- Qual a média de preço de um prato para 2 por país
### Cidade
- Qual o nome da cidade com mais restaurantes registrados
- Qual o nome da cidade que mais possui restaurante com nota media acima de 4
- Qual o nome da cidade que mais possui restaurantes com notas medias abaixo de 2.5
- Qual o nome da cidade que possui o maior valor médio de um prato para dois
- Qual o nome da cidade que possui a maior quantidade de tipos de culinárias
- Qual o nome da cidade que possui a maior quantidade de restaurantes que aceitam reservas
- Qual o nome da cidade que possui a maior quantidade de restaurantes que fazem entregas
- Qual o nome da cidade que possui a maior quantidade de restaurante que aceitam pedidos online
### Restaurantes
- Qual o nome do restaurantes com maior quantidade de avaliacoes
- Qual o nome do restaurante com a maior nota média
- Qual o nome do restaurante que possui o maior valor de um prato para 2 pessoas
- Qual o nome do restaurante com o tipo de culinaria com a menor media de avaliacao
- Qual o nome do restaurante de culinária brasileira, do Brasil, com maior avaliacao média
- Os restaurantes que aceitam pedido online são tambem, na média os que tem maior quantidade de avaliacoes registrada?
- Os restaurantes que fazem reserva são os que tem o maior valor de um prato para 2?
- Os restaurantes de culinaria japonesa dos EUA possuem um valor médio de prato para 2 pessoas são maior do que os do tipo BBQ?
- ### Culinária
- Dos restaurantes de culinária italiana, qual o que tem maior média de avaliacao
- Dos restaurantes de culinária italiana, qual o que tem menor média de avaliacao
- Dos restaurantes de culinária americana qual o que tem a maior média de avaliacao
- Dos restaurantes de culinária americana qual o que tem a menor média de avaliacao
- Dos restaurantes de culinária árabe qual o que tem a maior média de avaliacao
- Dos restaurantes de culinária árabe qual o que tem a menor média de avaliacao
- Dos restaurantes de culinária japonesa qual o que tem a maior média de avaliacao
- Dos restaurantes de culinária japonesa qual o que tem a menor média de avaliacao
- Dos restaurantes de culinária caseira qual o que tem a maior média de avaliacao
- Dos restaurantes de culinária caseira qual o que tem a menor média de avaliacao
- Qual o tipo de culinária com o maior valor médio de prato para 2
- Qual o tipo de culinária com maior nota média
- Qual o tipo de culinária que possui mais restaurantes que aceitam pedidos online e fazem entregas

# Importacao e das bibliotecas e das bases de dados

In [211]:
import pandas as pd
import numpy as np
import plotly.express as px

In [212]:
df_base = pd.read_csv('data/zomato.csv')
df_base.head()

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6310675,Mama Lou's Italian Kitchen,162,Las Piñas City,"Block 1, Lot 36, Tropical Avenue Corner Tropic...",BF International,"BF International, Las Piñas City",121.009787,14.447615,Italian,...,Botswana Pula(P),1,0,0,0,3,4.6,3F7E00,Excellent,619
1,6310675,Mama Lou's Italian Kitchen,162,Las Piñas City,"Block 1, Lot 36, Tropical Avenue Corner Tropic...",BF International,"BF International, Las Piñas City",121.009787,14.447615,Italian,...,Botswana Pula(P),1,0,0,0,3,4.6,3F7E00,Excellent,619
2,6314542,Blackbird,162,Makati City,"Nielson Tower, Ayala Triangle Gardens, Salcedo...","Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.024562,14.556042,"European, Asian",...,Botswana Pula(P),0,0,0,0,4,4.7,3F7E00,Excellent,469
3,6301293,Banapple,162,Makati City,"Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.023171,14.556196,"Filipino, American, Italian, Bakery",...,Botswana Pula(P),0,0,0,0,3,4.4,5BA829,Very Good,867
4,6315689,Bad Bird,162,Makati City,"Hole In The Wall, Floor 4, Century City Mall, ...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027708,14.565899,American,...,Botswana Pula(P),0,0,0,0,3,4.4,5BA829,Very Good,858

## Limpeza da base de dados

In [213]:
df_limpo = df_base.copy()

In [214]:
df_limpo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7527 entries, 0 to 7526
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Restaurant ID         7527 non-null   int64
 1   Restaurant Name       7527 non-null   object
 2   Country Code          7527 non-null   int64
 3   City                  7527 non-null   object
 4   Address               7527 non-null   object
 5   Locality              7527 non-null   object
 6   Locality Verbose      7527 non-null   object
 7   Longitude             7527 non-null   float64
 8   Latitude              7527 non-null   float64
 9   Cuisines              7512 non-null   object
 10  Average Cost for two  7527 non-null   int64
 11  Currency              7527 non-null   object
 12  Has Table booking     7527 non-null   int64
 13  Has Online delivery   7527 non-null   int64
 14  Is delivering now     7527 non-null   int64
 15  Switch to order menu  7527 non-null   int64
 16  Price range           7527 non-null   int64
 17  Aggregate rating      7527 non-null   float64
 18  Rating color          7527 non-null   object
 19  Rating text           7527 non-null   object
 20  Votes                 7527 non-null   int64
dtypes: float64(3), int64(9), object(9)
memory usage: 1.2+ MB

In [215]:
df_limpo.drop_duplicates(inplace=True)
df_limpo

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6310675,Mama Lou's Italian Kitchen,162,Las Piñas City,"Block 1, Lot 36, Tropical Avenue Corner Tropic...",BF International,"BF International, Las Piñas City",121.009787,14.447615,Italian,...,Botswana Pula(P),1,0,0,0,3,4.6,3F7E00,Excellent,619
2,6314542,Blackbird,162,Makati City,"Nielson Tower, Ayala Triangle Gardens, Salcedo...","Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.024562,14.556042,"European, Asian",...,Botswana Pula(P),0,0,0,0,4,4.7,3F7E00,Excellent,469
3,6301293,Banapple,162,Makati City,"Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.023171,14.556196,"Filipino, American, Italian, Bakery",...,Botswana Pula(P),0,0,0,0,3,4.4,5BA829,Very Good,867
4,6315689,Bad Bird,162,Makati City,"Hole In The Wall, Floor 4, Century City Mall, ...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027708,14.565899,American,...,Botswana Pula(P),0,0,0,0,3,4.4,5BA829,Very Good,858
5,6304833,Manam,162,Makati City,"Level 1, Greenbelt 2, Ayala Center, Greenbelt,...","Greenbelt 2, San Lorenzo, Makati City","Greenbelt 2, San Lorenzo, Makati City, Makati ...",121.020380,14.552351,Filipino,...,Botswana Pula(P),0,0,0,0,3,4.7,3F7E00,Excellent,930
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7522,5912546,Eataly,208,İstanbul,"Zorlu Center AVM, Köprü Katı, Levazım Mahalles...","Zorlu Center AVM, Levazım, Beşiktaş","Zorlu Center AVM, Levazım, Beşiktaş, İstanbul",29.017326,41.065322,"Italian, Pizza, Fresh Fish",...,Turkish Lira(TL),0,0,0,0,4,4.3,5BA829,Very Good,1367
7523,5913006,Tarihi Çınaraltı Aile Çay Bahçesi,208,İstanbul,"Çengelköy Mahallesi, Çınaraltı Camii Sokak, No...",Çengelköy Merkez,"Çengelköy Merkez, İstanbul",29.052620,41.050280,"Fast Food, Izgara, Seafood, Tea, Coffee",...,Turkish Lira(TL),0,0,0,0,2,4.5,3F7E00,Excellent,1172
7524,5923535,Boon Cafe & Restaurant,208,İstanbul,"Çengelköy Mahallesi, Çengelköy Caddesi, Kara S...",Çengelköy Merkez,"Çengelköy Merkez, İstanbul",29.052623,41.050717,Restaurant Cafe,...,Turkish Lira(TL),0,0,0,0,4,4.2,5BA829,Very Good,1160
7525,5914190,Kanaat Lokantası,208,İstanbul,"Sultantepe Mahallesi, Selmani Pak Caddesi, No ...",Üsküdar Merkez,"Üsküdar Merkez, İstanbul",29.016590,41.025741,"Home-made, Izgara",...,Turkish Lira(TL),0,0,0,0,3,4.0,5BA829,Very Good,770
7526,5913508,Katibim,208,İstanbul,"Mimar Sinan Mahallesi, Harem Sahilyolu, No 53,...",Üsküdar Merkez,"Üsküdar Merkez, İstanbul",29.010808,41.025501,"Restaurant Cafe, Kebab, Turkish Pizza",...,Turkish Lira(TL),0,0,0,0,4,4.2,5BA829,Very Good,1141

## Convertendo colunas para codigos assim como pede o as regras de negócios

In [216]:
#convertendo paises para o código correspondente a eles
COUNTRIES = {
   1: "India",
   14: "Australia",
   30: "Brazil",
   37: "Canada",
   94: "Indonesia",
   148: "New Zeland",
   162: "Philippines",
   166: "Qatar",
   184: "Singapure",
   189: "South Africa",
   191: "Sri Lanka",
   208: "Turkey",
   214: "United Arab Emirates",
   215: "England",
   216: "United States of America",
}

In [217]:
df_limpo["Country Code"] = df_limpo["Country Code"].map(COUNTRIES)
df_limpo["Country Code"]

0       Philippines
2       Philippines
3       Philippines
4       Philippines
5       Philippines
           ...
7522         Turkey
7523         Turkey
7524         Turkey
7525         Turkey
7526         Turkey
Name: Country Code, Length: 6942, dtype: object

In [218]:
df_limpo["Cuisines"].unique

<bound method Series.unique of 0                                       Italian
2                               European, Asian
3           Filipino, American, Italian, Bakery
4                                      American
5                                      Filipino
                         ...
7522                 Italian, Pizza, Fresh Fish
7523    Fast Food, Izgara, Seafood, Tea, Coffee
7524                            Restaurant Cafe
7525                          Home-made, Izgara
7526      Restaurant Cafe, Kebab, Turkish Pizza
Name: Cuisines, Length: 6942, dtype: object>

In [219]:
#deixando cada restaurante com apenas uma culinária
df_limpo["Cuisines"] = df_limpo["Cuisines"].apply(lambda x: str(x).split(",")[0])
df_limpo["Cuisines"]

0               Italian
2              European
3              Filipino
4              American
5              Filipino
             ...
7522            Italian
7523          Fast Food
7524    Restaurant Cafe
7525          Home-made
7526    Restaurant Cafe
Name: Cuisines, Length: 6942, dtype: object

In [220]:
#table booking
table = {0: "Not booking", 1: "Booking"}
df_limpo["Has Table booking"] = df_limpo["Has Table booking"].map(table)
df_limpo["Has Table booking"]

0           Booking
2       Not booking
3       Not booking
4       Not booking
5       Not booking
           ...
7522    Not booking
7523    Not booking
7524    Not booking
7525    Not booking
7526    Not booking
Name: Has Table booking, Length: 6942, dtype: object

In [221]:
#convertendo a coluna de online delivery
online = {1: "Delivering online", 0:"not delivering online"}
df_limpo["Has Online delivery"] = df_limpo["Has Online delivery"].map(online)
df_limpo["Has Online delivery"]

0       not delivering online
2       not delivering online
3       not delivering online
4       not delivering online
5       not delivering online
                ...
7522    not delivering online
7523    not delivering online
7524    not delivering online
7525    not delivering online
7526    not delivering online
Name: Has Online delivery, Length: 6942, dtype: object

In [222]:
#convertendo a coluna de entrega para categorica
delivery = {1:"Delivering", 0:"Not delivering"}
df_limpo["Is delivering now"] = df_limpo["Is delivering now"].map(delivery)
df_limpo["Is delivering now"]

0       Not delivering
2       Not delivering
3       Not delivering
4       Not delivering
5       Not delivering
             ...
7522    Not delivering
7523    Not delivering
7524    Not delivering
7525    Not delivering
7526    Not delivering
Name: Is delivering now, Length: 6942, dtype: object

In [223]:
#precos do restaurantes
def tipo_do_preco(preco):
   if preco == 1:
      return 'cheap'
   if preco == 2:
      return 'normal'
   if preco == 3:
      return 'expensive'
   else:
      return 'gourmet'

In [224]:
df_limpo["Price range"] = df_limpo["Price range"].map(tipo_do_preco)
df_limpo["Price range"]

0       expensive
2         gourmet
3       expensive
4       expensive
5       expensive
          ...
7522      gourmet
7523       normal
7524      gourmet
7525    expensive
7526      gourmet
Name: Price range, Length: 6942, dtype: object

In [225]:
#nome das cores
COLORS = {
   "3F7E00": "darkgreen",
   "5BA829": "green",
   "9ACD32": "lightgreen",
   "CDD614": "orange",
   "FFBA00": "red",
   "CBCBC8": "darkred",
   "FF7800": "darkred",
}

In [226]:
df_limpo["Rating color"] = df_limpo["Rating color"].map(COLORS)
df_limpo["Rating color"]

0       darkgreen
2       darkgreen
3           green
4           green
5       darkgreen
          ...
7522        green
7523    darkgreen
7524        green
7525        green
7526        green
Name: Rating color, Length: 6942, dtype: object

## Visao Geral

In [227]:
#Quantos restaurantes unicos estão registrados
quantidadeRestaurantes = df_limpo["Restaurant ID"].nunique()
quantidadeRestaurantes

6942

In [228]:
quantidadePaises = df_limpo["Country Code"].nunique()
quantidadePaises

15

In [229]:
quantidadeCidades = df_limpo["City"].nunique()
quantidadeCidades

125

In [230]:
quatidadeAvaliacoes = df_limpo["Votes"].sum()
int(quatidadeAvaliacoes)

4195634

In [231]:
quantidadeCulinaria = df_limpo["Cuisines"].nunique()
quantidadeCulinaria

166

# Visao País

In [232]:
agrupadoCidade = df_limpo.loc[:, ["City", "Country Code"]].groupby(["Country Code"]).nunique().sort_values(ascending=False, by="City").reset_index()
agrupadoCidade

                Country Code  City
0                      India    49
1   United States of America    22
2                Philippines    12
3               South Africa    12
4                    England     5
5                 New Zeland     4
6       United Arab Emirates     4
7                  Australia     3
8                     Brazil     3
9                     Canada     3
10                 Indonesia     3
11                    Turkey     2
12                     Qatar     1
13                 Singapure     1
14                 Sri Lanka     1

In [233]:
paisMaisCidade = agrupadoCidade.iloc[0,0]
paisMaisCidade

'India'

In [234]:
agrupadoRestaurantes = df_limpo.loc[:, ["Restaurant Name", "Country Code"]].groupby(["Country Code"]).nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoRestaurantes

                Country Code  Restaurant Name
0                      India             2489
1   United States of America             1276
2                    England              371
3               South Africa              307
4       United Arab Emirates              248
5                 New Zeland              233
6                     Brazil              229
7                  Australia              178
8                     Canada              178
9                     Turkey              145
10                 Singapure               80
11                 Sri Lanka               77
12                     Qatar               71
13               Philippines               59
14                 Indonesia               57

In [235]:
paisMaisRestaurante = agrupadoRestaurantes.iloc[0,0]
paisMaisRestaurante

'India'

In [238]:
filtro_restaurantes4 = df_limpo["Price range"] == "gourmet"
agrupadoRestaurantes4 = df_limpo.loc[filtro_restaurantes4, ["Restaurant Name", "Country Code"]].groupby(["Country Code"]).nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoRestaurantes4

                Country Code  Restaurant Name
0   United States of America              392
1               South Africa              195
2                      India              171
3                     Brazil              141
4       United Arab Emirates               87
5                 New Zeland               78
6                    England               75
7                  Singapure               58
8                     Canada               53
9                     Turkey               53
10                     Qatar               42
11                 Australia               32
12               Philippines               17
13                 Sri Lanka               16
14                 Indonesia               13

In [239]:
paisMaisRestaurante4 = agrupadoRestaurantes4.iloc[0,0]
paisMaisRestaurante4

'United States of America'

In [240]:
agrupadoCulinaria = df_limpo.loc[:, ["Cuisines", "Country Code"]].groupby(["Country Code"]).nunique().sort_values(ascending=False, by="Cuisines").reset_index()
agrupadoCulinaria

                Country Code  Cuisines
0                      India        78
1   United States of America        75
2                    England        52
3       United Arab Emirates        46
4                  Australia        43
5                     Brazil        43
6                     Canada        42
7               South Africa        42
8                 New Zeland        37
9                      Qatar        31
10                    Turkey        28
11                 Sri Lanka        26
12                 Indonesia        21
13                 Singapure        21
14               Philippines        14

In [241]:
paisMaisCulinaria = agrupadoCulinaria.iloc[0,0]
paisMaisCulinaria

'India'

In [244]:
agrupadoVotos = df_limpo.loc[:, ["Votes", "Country Code"]].groupby(["Country Code"]).sum().sort_values(ascending=False, by="Votes").reset_index()
agrupadoVotos

                Country Code    Votes
0                      India  2800199
1   United States of America   523414
2       United Arab Emirates   177564
3                  Australia   130357
4                     Canada   105018
5                     Turkey   100193
6                  Indonesia    89026
7               South Africa    81939
8                 New Zeland    52532
9                Philippines    48398
10                   England    39956
11                     Qatar    30106
12                 Sri Lanka    12133
13                    Brazil     2977
14                 Singapure     1822

In [245]:
paisMaisVotos = agrupadoVotos.iloc[0,0]
paisMaisVotos

'India'

In [246]:
filtro_restaurantes_delivery = df_limpo["Is delivering now"] == "Delivering"
agrupadoRestaurantesDelivery = df_limpo.loc[filtro_restaurantes_delivery, ["Restaurant Name", "Country Code"]].groupby(["Country Code"]).nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoRestaurantesDelivery

           Country Code  Restaurant Name
0                 India              917
1  United Arab Emirates               43
2           Philippines                7
3                 Qatar                3

In [247]:
paisMaisDelivery = agrupadoRestaurantesDelivery.iloc[0,0]
paisMaisDelivery

'India'

In [249]:
filtro_restaurantes_booking = df_limpo["Has Table booking"] == "Booking"
agrupadoRestaurantesBooking = df_limpo.loc[filtro_restaurantes_booking, ["Restaurant Name", "Country Code"]].groupby(["Country Code"]).nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoRestaurantesBooking

                Country Code  Restaurant Name
0                      India              198
1                    England               51
2                  Australia               29
3                 New Zeland               19
4                Philippines               15
5                  Indonesia               13
6       United Arab Emirates                9
7                      Qatar                4
8                     Turkey                4
9               South Africa                3
10  United States of America                2
11                 Sri Lanka                1

In [250]:
paisMaisReserva = agrupadoRestaurantesDelivery.iloc[0,0]
paisMaisReserva

'India'

In [251]:
agrupadoVotos = df_limpo.loc[:, ["Votes", "Country Code"]].groupby(["Country Code"]).mean().sort_values(ascending=False, by="Votes").reset_index()
agrupadoVotos

                Country Code        Votes
0                  Indonesia  1112.825000
1                      India   897.499679
2                  Australia   724.205556
3                     Turkey   630.144654
4                Philippines   604.975000
5       United Arab Emirates   591.880000
6                     Canada   583.433333
7   United States of America   379.835994
8                      Qatar   376.325000
9               South Africa   236.817919
10                New Zeland   219.799163
11                 Sri Lanka   151.662500
12                   England    99.890000
13                 Singapure    22.775000
14                    Brazil    12.404167

In [252]:
paisMaisVotosMedia = agrupadoVotos.iloc[0,0]
paisMaisVotosMedia

'Indonesia'

In [253]:
agrupadoNota = df_limpo.loc[:, ["Aggregate rating", "Country Code"]].groupby(["Country Code"]).mean().sort_values(ascending=False, by="Aggregate rating").reset_index()
agrupadoNota

                Country Code  Aggregate rating
0                  Indonesia          4.601250
1                Philippines          4.463750
2                  Singapure          4.435000
3   United States of America          4.402322
4                  Australia          4.372778
5                     Canada          4.321667
6                     Turkey          4.310063
7                      Qatar          4.240000
8                 New Zeland          4.164435
9               South Africa          4.061561
10                 Sri Lanka          4.057500
11                   England          4.041750
12                     India          4.027532
13      United Arab Emirates          4.023667
14                    Brazil          3.321667

In [254]:
paisMaiorNota = agrupadoNota.iloc[0,0]
paisMaiorNota

'Indonesia'

In [255]:
agrupadoNota2 = df_limpo.loc[:, ["Aggregate rating", "Country Code"]].groupby(["Country Code"]).mean().sort_values(ascending=True, by="Aggregate rating").reset_index()
agrupadoNota2

                Country Code  Aggregate rating
0                     Brazil          3.321667
1       United Arab Emirates          4.023667
2                      India          4.027532
3                    England          4.041750
4                  Sri Lanka          4.057500
5               South Africa          4.061561
6                 New Zeland          4.164435
7                      Qatar          4.240000
8                     Turkey          4.310063
9                     Canada          4.321667
10                 Australia          4.372778
11  United States of America          4.402322
12                 Singapure          4.435000
13               Philippines          4.463750
14                 Indonesia          4.601250

In [256]:
paisMenorNota = agrupadoNota2.iloc[0,0]
paisMenorNota

'Brazil'

In [257]:
agrupadoPP2 = df_limpo.loc[:, ["Average Cost for two", "Country Code"]].groupby(["Country Code"]).mean().sort_values(ascending=False, by="Average Cost for two").reset_index()
agrupadoPP2

                Country Code  Average Cost for two
0                  Indonesia         303000.000000
1                  Australia         138959.783333
2                  Sri Lanka           2579.375000
3                Philippines           1227.825000
4                      India            703.602564
5               South Africa            339.228324
6                      Qatar            174.000000
7       United Arab Emirates            153.716667
8                  Singapure            141.437500
9                     Brazil            138.812500
10                    Turkey            128.584906
11                New Zeland             62.154812
12  United States of America             55.018868
13                   England             43.510000
14                    Canada             41.861111

# Visao Cidade

In [260]:
agrupadoCidadeRestaurante = df_limpo.loc[:, ["City", "Restaurant Name"]].groupby(["City"]).nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoCidadeRestaurante

                   City  Restaurant Name
0             Edinburgh               80
1             Singapore               80
2              Hamilton               79
3                Dallas               79
4             São Paulo               79
..                  ...              ...
120  Johannesburg South                1
121      Las Piñas City                1
122          Roodepoort                1
123       Marikina City                1
124           Ghaziabad                1

[125 rows x 2 columns]

In [261]:
cidadeMaisRestaurante = agrupadoCidadeRestaurante.iloc[0,0]
cidadeMaisRestaurante

'Edinburgh'

In [264]:
filtro_cidade_restaurante_avaliado4 = df_limpo["Aggregate rating"] > 4
agrupadoCidadeRestauranteAvaliado = df_limpo.loc[filtro_cidade_restaurante_avaliado4, ["City", "Restaurant Name"]].groupby("City").nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoCidadeRestauranteAvaliado

               City  Restaurant Name
0           Houston               72
1          Auckland               72
2            London               71
3          İstanbul               66
4           Kolkata               64
..              ...              ...
116           Nasik                1
117       Ghaziabad                1
118  Las Piñas City                1
119        Zirakpur                1
120   Marikina City                1

[121 rows x 2 columns]

In [265]:
CidadeMaisRestauranteAvaliado = agrupadoCidadeRestauranteAvaliado.iloc[0,0]
CidadeMaisRestauranteAvaliado

'Houston'

In [266]:
filtro_cidade_restaurante_avaliado25 = df_limpo["Aggregate rating"] < 4
agrupadoCidadeRestauranteRuimAvaliado = df_limpo.loc[filtro_cidade_restaurante_avaliado25, ["City", "Restaurant Name"]].groupby("City").nunique().sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoCidadeRestauranteRuimAvaliado

                City  Restaurant Name
0            Gangtok               78
1               Ooty               75
2             Shimla               75
3           Brasília               69
4           Fujairah               60
..               ...              ...
86           Detroit                1
87  Mandaluyong City                1
88             Nasik                1
89      Philadelphia                1
90      Johannesburg                1

[91 rows x 2 columns]

In [267]:
CidadeMaisRestauranteRuimAvaliado = agrupadoCidadeRestauranteRuimAvaliado.iloc[0,0]
CidadeMaisRestauranteRuimAvaliado

'Gangtok'

In [270]:
agrupadoCidadePratoPara2 = df_limpo.loc[:,["City", "Average Cost for two"]].groupby("City").mean("Average Cost for two").sort_values(ascending=False, by="Average Cost for two").reset_index()
agrupadoCidadePratoPara2

            City  Average Cost for two
0       Adelaide         416734.133333
1        Jakarta         309605.263158
2      Tangerang         180000.000000
3          Bogor         175000.000000
4     Pasay City           4000.000000
..           ...                   ...
120      Calgary             32.500000
121  Los Angeles             30.666667
122       Denver             29.916667
123      Phoenix             28.000000
124      Detroit             25.750000

[125 rows x 2 columns]

In [271]:
cidadeMaiorValorPara2 = agrupadoCidadePratoPara2.iloc[0,0]
cidadeMaiorValorPara2

'Adelaide'

In [272]:
agrupadoCidadeCulinaria = df_limpo.loc[:, ["City", "Cuisines"]].groupby("City").nunique("Cuisines").sort_values(ascending=False, by="Cuisines").reset_index()
agrupadoCidadeCulinaria

                City  Cuisines
0         Birmingham        32
1               Doha        31
2           Montreal        30
3          São Paulo        30
4         Manchester        30
..               ...       ...
120   Las Piñas City         1
121    Marikina City         1
122       Roodepoort         1
123  Muntinlupa City         1
124        Ghaziabad         1

[125 rows x 2 columns]

In [273]:
CidadeMaisCulinaria = agrupadoCidadeCulinaria.iloc[0,0]
CidadeMaisCulinaria

'Birmingham'

In [276]:
filtro_cidade_reserva = df_limpo["Has Table booking"] == "Booking"
agrupadoCidadeReserva = df_limpo.loc[filtro_cidade_reserva, ["City", "Restaurant Name"]].groupby("City").nunique("Restaurant Name").sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoCidadeReserva

            City  Restaurant Name
0      Bangalore               32
1        Chennai               23
2           Pune               22
3       Brisbane               17
4       Auckland               17
..           ...              ...
64    Pasig City                1
65      Fujairah                1
66        Nashik                1
67  Johannesburg                1
68       Colombo                1

[69 rows x 2 columns]

In [277]:
CidadeMaisReserva = agrupadoCidadeReserva.iloc[0,0]
CidadeMaisReserva

'Bangalore'

In [278]:
filtro_cidade_entrega = df_limpo["Is delivering now"] == "Delivering"
agrupadoCidadeEntrega = df_limpo.loc[filtro_cidade_entrega, ["City", "Restaurant Name"]].groupby("City").nunique("Restaurant Name").sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoCidadeEntrega

            City  Restaurant Name
0     Aurangabad               46
1       Amritsar               45
2       Dehradun               44
3       Vadodara               43
4       Ludhiana               41
5         Ranchi               40
6       Varanasi               39
7        Lucknow               37
8      Ahmedabad               37
9         Jaipur               36
10        Indore               36
11        Bhopal               35
12        Nagpur               33
13    Chandigarh               33
14        Kanpur               32
15          Agra               31
16     Allahabad               31
17        Mysore               27
18  Bhubaneshwar               27
19        Nashik               26
20     Mangalore               26
21         Surat               24
22         Patna               23
23     Abu Dhabi               23
24          Ooty               22
25         Vizag               22
26    Puducherry               20
27        Mumbai               19
28    Coimbatore               19
29         Kochi               18
30       Kolkata               17
31          Pune               17
32     New Delhi               15
33      Guwahati               14
34       Sharjah               14
35       Chennai               12
36         Dubai               12
37     Hyderabad               12
38        Mohali               11
39     Bangalore                8
40   Taguig City                5
41           Goa                4
42       Gurgaon                4
43     Panchkula                4
44          Doha                3
45   Makati City                2
46         Noida                2
47         Nasik                2
48  Secunderabad                2
49   Gandhinagar                1
50         Thane                1

In [279]:
cidadeMaiorEntrega = agrupadoCidadeEntrega.iloc[0,0]
cidadeMaiorEntrega

'Aurangabad'

In [280]:
filtro_cidade_online = df_limpo["Has Online delivery"] == "Delivering online"
agrupadoCidadeOnline = df_limpo.loc[filtro_cidade_online, ["City", "Restaurant Name"]].groupby("City").nunique("Restaurant Name").sort_values(ascending=False, by="Restaurant Name").reset_index()
agrupadoCidadeOnline

            City  Restaurant Name
0     Aurangabad               68
1       Vadodara               68
2      Allahabad               66
3         Ranchi               66
4       Varanasi               65
5        Sharjah               65
6         Nagpur               64
7         Kanpur               62
8      Mangalore               62
9           Agra               62
10      Ludhiana               61
11     Abu Dhabi               60
12      Amritsar               60
13      Dehradun               60
14       Kolkata               59
15       Lucknow               59
16        Mysore               58
17        Indore               58
18        Jaipur               58
19    Coimbatore               57
20         Patna               57
21  Bhubaneshwar               56
22     Ahmedabad               56
23        Bhopal               55
24         Dubai               55
25         Surat               54
26     Hyderabad               52
27         Kochi               52
28         Vizag               50
29       Chennai               49
30          Pune               46
31        Nashik               45
32    Chandigarh               43
33        Mumbai               41
34          Ooty               40
35    Puducherry               35
36          Doha               33
37      Guwahati               33
38     New Delhi               29
39     Bangalore               26
40        Mohali               13
41           Goa               10
42     Panchkula                6
43   Taguig City                6
44  Secunderabad                5
45         Noida                4
46       Gurgaon                4
47   Makati City                3
48         Thane                3
49         Nasik                2
50     Ghaziabad                1
51   Gandhinagar                1
52      Zirakpur                1

In [281]:
CidadeMaisOnline = agrupadoCidadeOnline.iloc[0,0]
CidadeMaisOnline

'Aurangabad'

# Visao Restaurante